system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



application     mychtMultiRegionSimpleFoam;

startFrom       latestTime;//startTime

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;//use "binary" while meshing  

writePrecision  6;// use "15" while meshing 

writeCompression off;

timeFormat      general;

timePrecision   6;

maxCo 0.3;

runTimeModifiable true;
libs            
(
	"USource.so"
	"kSource.so"
	"epsilonSource.so"
	"ESource.so"
	"specHumSource.so"
	"atmosphericModels"
	
);

functions
{
GLeaf
    {
        type GLeaf;
        libs ("GLeaf.so");
		executeControl      timeStep;
        executeInterval     1;
        writeControl        writeTime;
		region air;
    }

TLeaf
    {
        type TLeaf;
        libs ("TLeaf.so");
		executeControl      timeStep;
        executeInterval     1;
        writeControl        writeTime;
		region air;
    }
}


// ************************************************************************* //
