constant/air/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type        transparent;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        emissivity      (1);
        absorptivity    (0);
    }

}
	
air_to_buildings
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.3; // 0: all specular 1: all diffusive	
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.7);
        emissivity      (0.9);
    };
}

air_to_soil2
{
    type       opaqueDiffusive;	
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (1.0);
        emissivity      (0.9);
    };
}

air_to_concrete
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.3; // 0: all specular 1: all diffusive
    wallAbsorptionEmissionModel
	{
        type            multiBandAbsorption;
        absorptivity    (0.7);
        emissivity      (0.9);
    };
}

air_to_asphalt
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.2; // 0: all specular 1: all diffusive
	wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.8);
        emissivity      (0.95);
    };
}	
	
air_to_base
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.3; // 0: all specular 1: all diffusive
	wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.7);
        emissivity      (0.9);
    };	
}

// ************************************************************************* //
