0.orig/air/GLeaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    side
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_soil2
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_buildings
    {
        type            calculated;
        value           uniform 0;
    }
	air_to_concrete
    {
        type            calculated;
        value           uniform 0;
    }
	air_to_asphalt
    {
        type            calculated;
        value           uniform 0;
    }
	air_to_base
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
