0.orig/concrete/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 305.15;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
        value           $internalField;
    }
	concrete_to_air
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           qr;
        qr              none;
        kappa           none;
    }
    concrete_to_soil2
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
	concrete_to_asphalt
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
	concrete_to_soil1
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
	concrete_to_buildings
    {
        type            externalWallHeatFluxTemperature;
 
        mode            coefficient;
 
        Ta              constant 293.15;
        h               constant 10.0;
        thicknessLayers (0.4);
        kappaLayers     (1.6);
 
        kappaMethod     solidThermo;
		qr              none;
 
        value           $internalField;
    }
}


// ************************************************************************* //
