0.orig/soil1/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 305.15;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
        value           $internalField;
    }
	ground
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 283.15;
        h               uniform 1000000;
        thicknessLayers ( 8 );
        kappaLayers     ( 1.8 );
        kappaMethod     solidThermo;
        kappa           none;
        value           uniform 305.15;
    }
    soil1_to_soil2
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
	soil1_to_asphalt
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
	soil1_to_concrete
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
}


// ************************************************************************* //
