system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }
	
	p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }
	
	p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }


    "(U|h|k|epsilon|R|specHum|)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
	Ii
    {
        solver              GAMG;
        tolerance           1e-4;
        relTol              0.1;
        smoother            symGaussSeidel;
        maxIter             10;
        nPostSweeps         1;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       100000;
    rhoMin          0.2;
    rhoMax          2;
}


relaxationFactors
{
    fields
    {
        p_rgh           0.7;
		rho             1.0;
    }
    equations
    {
        U               0.3;
        h               0.5;
		G               0.5;
		specHum         0.5;
        "(k|epsilon|R)" 0.7;
		"ILambda.*"     0.7;
		qr              0.5;
    }
}


// ************************************************************************* //
