system/air/setFieldsDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
);

regions
(
    // Set grass values
	
	 cellToCell
     {
         set grass;

         fieldValues
         (
			 volScalarFieldValue LAD 1 //  LAD = LAI_grass / H_grass
         );
     }
	
);

// ************************************************************************* //
